open-isa-rv32m1/rv32m1_sdk_riscv/boards/rv32m1_vega/demo_apps/power_mode_switch/ri5cy/pin_mux.h
/*
 * Copyright 2018 NXP
 * All rights reserved.
 * 
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    KPIN_MUX_DirectionInput = 0U,   /* Input direction */
    KPIN_MUX_DirectionOutput = 1U,  /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /*Input or output direction*/
}pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_Core0(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/*******************************************************************************
 * EOF
 ******************************************************************************/